import "./TaskPage.scss"
import { useState } from "react"

const TaskPage = () => {
	const [currTask, setCurrTask] = useState(null)

	const allTasks = [
		"Приберіть пластикові пляшки та інше сміття у своєму місці проживання та віднесіть їх до спеціальних контейнерів для відходів.",
		"Спробуйте провести день без використання речей з пластику.",
		"Відсортуйте все сміття, яке у вас є.",
		"Використайте велосипед або ходи пішки , замість свого автомобіля.",
		"Встановіть енергоефективні лампочки у себе вдома.",
		"Переробіть якийсь старий предмети замість того щоб його викинути.",
		"Долучіться до екологічного заходу в своєму місті.",
		"Відвідай місцевий фермерський ринок та підтримайте місцевих фермерів.",
		"Зробіть власні природні миючі засоби.",
		"Придбайте товари з мінімальною упаковкою.",
		"Сьогодні мінімально витрачайте електроенергію.",
		"Використовуйте тканинні сумки для покупок замість пластикових пакетів.",
		"Збільшіть кількість рослин у домі для покращення якості повітря.",
		"Використовуйте власні тканинні рушники та серветки замість одноразових паперових.",
		"Не викидайте батарейки, а віддайте у спеціальні місця збору.",
		"Долучіться до події що є в вкладці 'Події'.",
		"Розкажіть другу про цей додаток.",
		"Проведіть день без використання електронних пристроїв та гаджетів, вибираючи активний відпочинок на свіжому повітрі.",
		"Посадіть дерево або іншу рослину.",
		"Під час прогулянки збирайте сміття на своїй вулиці або в місцевому парку.",
		"Використайте натуральні матеріали для прикраси вашого дому, замість синтетичних або пластмасових.",
		"Економте воду.",
		"Віддайте стару техніку на переробку.",
		"Оплатіть рахунок онлайн.",
		"Вимикайте зарядні пристрої вночі.",
		"Відмовтесь від фастфуду, готуйте дома.",
		"Віддайте скло на переробку.",
		"Станьте вегетаріанцем на день.",
		"Замість ванни прийміть душ.",
		"Поділіться екологічними порадами з друзями."
	]

	const generateTask = () => {
		let generateNumber = Math.floor(Math.random() * allTasks.length)

		while (generateNumber === currTask) {
			generateNumber = Math.floor(Math.random() * allTasks.length)
		}

		setCurrTask(generateNumber)
	}

	return (
		<section className="task">
			<div className="container">
				<h2>Екологічне завдання на день</h2>
				<p>Ласкаво просимо до денного екологічного виклику! <br />
					Тут ви отримаєте коротке, просте завдання, яке допоможе зробити нашу планету зеленішою та чистішою. Виконайте його та приєднуйтесь до руху за збереження навколишнього середовища! </p>

				<p className="task-descr">{(currTask || currTask == 0) && allTasks[currTask]}</p>

				<button onClick={generateTask} className="btn">Отримати завдання</button>
			</div>
		</section>
	)
}

export default TaskPage